src/logs/page/test-page-home-20250730-170556.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/page/test-page-home.ts
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 30 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 20 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  01.0s/30s

running (0m02.0s), 30/30 VUs, 63 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  02.0s/30s

running (0m03.0s), 30/30 VUs, 106 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  03.0s/30s

running (0m04.0s), 30/30 VUs, 128 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  04.0s/30s

running (0m05.0s), 30/30 VUs, 169 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  05.0s/30s

running (0m06.0s), 30/30 VUs, 241 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  06.0s/30s

running (0m07.0s), 30/30 VUs, 293 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  07.0s/30s

running (0m08.0s), 30/30 VUs, 345 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  08.0s/30s

running (0m09.0s), 30/30 VUs, 402 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  09.0s/30s

running (0m10.0s), 30/30 VUs, 453 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  10.0s/30s

running (0m11.0s), 30/30 VUs, 506 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  11.0s/30s

running (0m12.0s), 30/30 VUs, 561 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  12.0s/30s

running (0m13.0s), 30/30 VUs, 617 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  13.0s/30s

running (0m14.0s), 30/30 VUs, 673 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  14.0s/30s

running (0m15.0s), 30/30 VUs, 726 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  15.0s/30s

running (0m16.0s), 30/30 VUs, 778 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  16.0s/30s

running (0m17.0s), 30/30 VUs, 834 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  17.0s/30s

running (0m18.0s), 30/30 VUs, 886 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  18.0s/30s

running (0m19.0s), 30/30 VUs, 943 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  19.0s/30s

running (0m20.0s), 30/30 VUs, 1001 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  20.0s/30s

running (0m21.0s), 30/30 VUs, 1059 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  21.0s/30s

running (0m22.0s), 30/30 VUs, 1118 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  22.0s/30s

running (0m23.0s), 30/30 VUs, 1178 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  23.0s/30s

running (0m24.0s), 30/30 VUs, 1235 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  24.0s/30s

running (0m25.0s), 30/30 VUs, 1274 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  25.0s/30s

running (0m26.0s), 30/30 VUs, 1287 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  26.0s/30s

running (0m27.0s), 30/30 VUs, 1316 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  27.0s/30s

running (0m28.0s), 30/30 VUs, 1381 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  28.0s/30s

running (0m29.0s), 30/30 VUs, 1438 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  29.0s/30s

running (0m30.0s), 30/30 VUs, 1498 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......................: 1529    50.150629/s
    checks_succeeded...................: 100.00% 1529 out of 1529
    checks_failed......................: 0.00%   0 out of 1529

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=583.6ms  min=161.13ms med=536.76ms max=2.73s p(90)=702.54ms p(95)=1.03s
      { expected_response:true }............................................: avg=583.6ms  min=161.13ms med=536.76ms max=2.73s p(90)=702.54ms p(95)=1.03s
    http_req_failed.........................................................: 0.00%  0 out of 1529
    http_reqs...............................................................: 1529   50.150629/s

    EXECUTION
    iteration_duration......................................................: avg=593.65ms min=193.72ms med=540.6ms  max=2.73s p(90)=721.38ms p(95)=1.06s
    iterations..............................................................: 1529   50.150629/s
    vus.....................................................................: 30     min=30        max=30
    vus_max.................................................................: 30     min=30        max=30

    NETWORK
    data_received...........................................................: 64 MB  2.1 MB/s
    data_sent...............................................................: 157 kB 5.1 kB/s



running (0m30.5s), 00/30 VUs, 1529 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  30s